src/cf/InformationRegisters/ШкалаБонусныхПроцентовОтПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ШкалаБонусныхПроцентовОтПродаж</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БонусныйПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПропорциональноОтОбщихПродаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДляРасчетаКотлаПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НижнийПорогОбъемаПродаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерхнийПорогОбъемаПродаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидБонуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБонусов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентОтОбщихБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СегментНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыБонусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыБонусов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Личные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Групповые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КотелПропорциональный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КотелРуководителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проектные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Партнерские</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПартнерскиеГрупповые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дизайнерские</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Промоутерские</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ШкалаБонусныхПроцентовОтПродаж/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВидБонусаПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Если Запись.ВидБонуса = Перечисления.ВидыБонусов.Личные или Запись.ВидБонуса = Перечисления.ВидыБонусов.Партнерские тогда
		Элементы.ПроцентОтОбщихБонусов.ТолькоПросмотр = Истина;
		Элементы.ПропорциональноОтОбщихПродаж.ТолькоПросмотр = Истина;
		Элементы.НижнийПорогОбъемаПродаж.ТолькоПросмотр = Ложь;
		Элементы.ВерхнийПорогОбъемаПродаж.ТолькоПросмотр = Ложь;
		Элементы.БонусныйПроцент.ТолькоПросмотр = Ложь;
		Элементы.Подразделение.ТолькоПросмотр = Ложь;
		Элементы.Должность.ТолькоПросмотр = Ложь;
		Элементы.Основной.ТолькоПросмотр = Истина;
	ИначеЕсли Запись.ВидБонуса = Перечисления.ВидыБонусов.Групповые или Запись.ВидБонуса = Перечисления.ВидыБонусов.ПартнерскиеГрупповые тогда
		Элементы.ПроцентОтОбщихБонусов.ТолькоПросмотр = Истина;
		Элементы.ПропорциональноОтОбщихПродаж.ТолькоПросмотр = Истина;
		Элементы.НижнийПорогОбъемаПродаж.ТолькоПросмотр = Ложь;
		Элементы.ВерхнийПорогОбъемаПродаж.ТолькоПросмотр = Ложь;
		Элементы.БонусныйПроцент.ТолькоПросмотр = Ложь;
		Элементы.Подразделение.ТолькоПросмотр = Ложь;
		Элементы.Должность.ТолькоПросмотр = Ложь;
		Элементы.Основной.ТолькоПросмотр = Истина;
	ИначеЕсли Запись.ВидБонуса = Перечисления.ВидыБонусов.КотелПропорциональный тогда
		Элементы.НижнийПорогОбъемаПродаж.ТолькоПросмотр = Ложь;
		Элементы.ВерхнийПорогОбъемаПродаж.ТолькоПросмотр = Истина;
		Элементы.БонусныйПроцент.ТолькоПросмотр = Истина;
		Элементы.ПроцентОтОбщихБонусов.ТолькоПросмотр = Истина;
		Элементы.ПропорциональноОтОбщихПродаж.ТолькоПросмотр = Ложь;
		Элементы.Подразделение.ТолькоПросмотр = Ложь;
		Элементы.Должность.ТолькоПросмотр = Ложь;
		Элементы.Основной.ТолькоПросмотр = Истина;
	ИначеЕсли Запись.ВидБонуса = Перечисления.ВидыБонусов.КотелРуководителя тогда
		Элементы.ПроцентОтОбщихБонусов.ТолькоПросмотр = Ложь;
		Элементы.ПропорциональноОтОбщихПродаж.ТолькоПросмотр = Истина;
		Элементы.НижнийПорогОбъемаПродаж.ТолькоПросмотр = Ложь;
		Элементы.ВерхнийПорогОбъемаПродаж.ТолькоПросмотр = Ложь;
		Элементы.БонусныйПроцент.ТолькоПросмотр = Ложь;
		Элементы.Подразделение.ТолькоПросмотр = Ложь;
		Элементы.Должность.ТолькоПросмотр = Ложь;
		Элементы.Основной.ТолькоПросмотр = Ложь;
	ИначеЕсли Запись.ВидБонуса = Перечисления.ВидыБонусов.Проектные или Запись.ВидБонуса.Пустая() тогда
		Элементы.Подразделение.ТолькоПросмотр = Истина;
		Элементы.Должность.ТолькоПросмотр = Истина;
		Элементы.ПроцентОтОбщихБонусов.ТолькоПросмотр = Истина;
		Элементы.ПропорциональноОтОбщихПродаж.ТолькоПросмотр = Истина;
		Элементы.НижнийПорогОбъемаПродаж.ТолькоПросмотр = Истина;
		Элементы.ВерхнийПорогОбъемаПродаж.ТолькоПросмотр = Истина;
		Элементы.БонусныйПроцент.ТолькоПросмотр = Истина;
		Элементы.Основной.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеЭлементамиФормы();
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	

	
КонецПроцедуры
